Ext.define('Locale.hy_AM.workflow.journal.View', {

    constructor: function() {
        Ext.applyIf(this.translations["hy_AM"], {
            "journalView": "Սեղանամատյանի դիտում",
            "transaction_code":"Գործարքի կոդ",
            "tr_creation_date":"Նոտարական գործողության կատարման <br /> ամսաթիվը, ամիսը, տարեթիվը",
            "subjects":"Անձանց և նրանց ներկայացուցիչների  <br /> անունը,ազգանունը, հայրանունը և  <br />  բնակաության վայրը,որոնց համար   <br />  կատարված է նոտարական գործողությունը ",
            "notarial_action_content":"Նոտարական գործողությունների <br/> բովանդակություն",
            "identification_documents":"Նոտարական գործողությունների կատարմանը մասնակցող<br /> անձանց ինքնությունը հաստատող փաստաթղթերը",
            "state_fee_coefficient":"Գանձված է<br /> միասնական<br /> պետական տուրք<br /> կամ նշում<br /> պետական տուրքից<br /> ազատման մասին",
            "service_fee_coefficient":"Վճարովի<br /> ծառայություններից<br /> ստացված<br /> եկամուտի<br /> գումարը",

            /*"transaction_code":"Գործարքի կոդ",
            "tr_creation_date":"Նոտարական գործողության կատարման  ամսաթիվը, ամիսը, տարեթիվը",
            "subjects":"Անձանց և նրանց ներկայացուցիչների անունը, ազգանունը, հայրանունը և բնակաության վայրը, որոց համար կատարված է նոտարական գործողությունը ",
            "notarial_action_content":"Նոտարական գործողությունների բովանդակություն",
            "identification_documents":"Նոտարական գործողությունների կատարմանը մասնակցող անձանց ինքնությունը հաստատող փաստաթղթերը",
            "state_fee_coefficient":"Գանձված է միասնական պետական տուրք կամ նշում պետական տուրքից ազատման մասին",
            "service_fee_coefficient":"Վճարովի ծառայություններից ստացված եկամուտի գումարը",*/
            "export_excel":"Արտահանել Excel"
        });
    }
});
